Repository: jawadpython/solarapp1
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# fillTime
source: Fill time (hours)
ar: وقت التعبئة (ساعات)
fr: Temps de remplissage (heures)

# wellDepth
source: Well depth (m)
ar: عمق البئر (م)
fr: Profondeur du puits (m)

# tankHeight
source: Tank height (m)
ar: ارتفاع الخزان (م)
fr: Hauteur du réservoir (m)

# fieldRequired
source: This field is required
ar: هذا الحقل إلزامي
fr: Ce champ est obligatoire

# valueMustBeGreater
source: Value must be greater than 0
ar: يجب أن تكون القيمة أكبر من 0
fr: La valeur doit être supérieure à 0

source: Invalid values
ar: قيم غير صالحة
fr: Valeurs invalides

# systemTypeRequired
source: System Type *
ar: نوع النظام *
fr: Type de système *

# selectSystemTypeHint
source: Select a system type
ar: اختر نوع النظام
fr: Sélectionnez un type de système

# billAmountLabel
source: Bill amount (DH) *
ar: مبلغ الفاتورة (درهم) *
fr: Montant facture (DH) *

# billAmountExample
source: Ex: 500
ar: مثال: 500

# amountMustBeGreaterThanZero
source: Amount must be greater than 0
ar: يجب أن يكون المبلغ أكبر من 0
fr: Le montant doit être supérieur à 0

# usageTypeLabel
source: Usage Type
ar: نوع الاستخدام
fr: Type d'utilisation

# selectUsageTypeHint
source: Select a type
ar: اختر نوعاً
fr: Sélectionnez un type

# batteryCapacity
source: Battery capacity (kWh)
ar: سعة البطارية (كيلوواط ساعة)
fr: Capacité batterie (kWh)

# batteryCapacityRequired
source: Battery capacity (kWh) *
ar: سعة البطارية (كيلوواط ساعة) *
fr: Capacité batterie (kWh) *

# selectBatteryCapacity
source: Select a capacity
ar: اختر السعة
fr: Sélectionnez une capacité

# consumptionPerDay
source: Consumption (kWh/day) *
ar: الاستهلاك (كيلوواط ساعة/يوم) *
fr: Consommation (kWh/jour) *

# consumptionExample
source: Ex: 10
ar: مثال: 10

# consumptionMustBeGreater
source: Consumption must be greater than 0
ar: يجب أن يكون الاستهلاك أكبر من 0
fr: La consommation doit être supérieure à 0

source: Autonomy days *
ar: أيام الاستقلالية *
fr: Jours d'autonomie *

# selectAutonomy
source: Select
ar: اختر
fr: Sélectionnez

source: day
ar: يوم
fr: jour

source: days
ar: أيام
fr: jours

# flowLabel
source: Flow *
ar: التدفق *
fr: Débit *

# flowExample
source: Ex: 10
ar: مثال: 10

# flowMustBeGreaterThanZero
source: Flow must be greater than 0
ar: يجب أن يكون التدفق أكبر من 0
fr: Le débit doit être supérieur à 0

# unitLabel
source: Unit *
ar: الوحدة *
fr: Unité *

# unitHint
source: Unit
ar: الوحدة
fr: Unité

# headMetersLabel
source: Head (m) *
ar: الارتفاع المانومتري (م) *
fr: Hauteur manométrique (m) *

# headExample
source: Ex: 50
ar: مثال: 50

# headMustBeGreater
source: Head must be greater than 0
ar: يجب أن يكون الارتفاع أكبر من 0
fr: La hauteur doit être supérieure à 0

# operatingHoursLabel
source: Operating hours per day *
ar: ساعات التشغيل في اليوم *
fr: Heures de fonctionnement par jour *

# hoursExample
source: Ex: 8
ar: مثال: 8

# hoursMustBeGreater
source: Hours must be greater than 0
ar: يجب أن تكون الساعات أكبر من 0
fr: Les heures doivent être supérieures à 0

# pumpTypeLabel
source: Pump type *
ar: نوع المضخة *
fr: Type de pompe *

# selectPumpTypeHint
source: Select a type
ar: اختر نوعاً
fr: Sélectionnez un type

# selectSystemTypeError
source: Please select a system type
ar: يرجى اختيار نوع النظام
fr: Veuillez sélectionner un type de système

# selectRegionError
source: Please select a region
ar: يرجى اختيار المنطقة
fr: Veuillez sélectionner une région

# fillAllRequiredFields
source: Please fill all required fields
ar: يرجى ملء جميع الحقول الإلزامية
fr: Veuillez remplir tous les champs obligatoires

source: Invalid amount
ar: مبلغ غير صالح
fr: Montant invalide

source: Invalid consumption
ar: استهلاك غير صالح
fr: Consommation invalide

source: Battery and autonomy required
ar: البطارية والاستقلالية مطلوبة
fr: Batterie et autonomie requis

source: Invalid system type
ar: نوع نظام غير صالح
fr: Type de système invalide

# errorPrefix
source: Error
ar: خطأ
fr: Erreur

# resultOnGrid
source: ON-GRID Result
ar: نتيجة ON-GRID
fr: Résultat ON-GRID

# resultHybrid
source: HYBRID Result
ar: نتيجة HYBRID
fr: Résultat HYBRID

# resultOffGrid
source: OFF-GRID Result
ar: نتيجة OFF-GRID
fr: Résultat OFF-GRID

# resultPumping
source: Solar Pumping Result
ar: نتيجة الضخ الشمسي
fr: Résultat Pompage Solaire

# calculationResultsTitle
source: Calculation Results
ar: نتائج الحساب
fr: Résultats du Calcul

# estimatedConsumptionLabel
source: Estimated consumption
ar: الاستهلاك المقدر
fr: Consommation estimée

# recommendedSystemPowerLabel
source: Recommended system power
ar: قوة النظام الموصى بها
fr: Puissance système recommandée

# numberOfPanelsLabel
source: Number of panels
ar: عدد الألواح
fr: Nombre de panneaux

# savingRateLabel
source: Saving rate
ar: معدل التوفير
fr: Taux d'économie

# savingsTitle
source: Savings
ar: التوفير
fr: Économies

# monthlyLabel
source: Monthly
ar: شهري
fr: Mensuelle

# yearlyLabel
source: Yearly
ar: سنوي
fr: Annuelle

# tenYearsLabel
source: 10 years
ar: 10 سنوات
fr: 10 ans

# twentyYearsLabel
source: 20 years
ar: 20 سنة
fr: 20 ans

# basedOnSunHoursInfo
source: Based on {hours}h of sun per day - {region}
ar: بناءً على {hours} ساعة من الشمس يومياً - {region}
fr: Basé sur {hours}h de soleil par jour - {region}

source: Daily consumption
ar: الاستهلاك اليومي
fr: Consommation quotidienne

# batteryCapacityLabel
source: Battery capacity
ar: سعة البطارية
fr: Capacité batterie

# autonomyLabel
source: Autonomy
ar: الاستقلالية
fr: Autonomie

source: Battery coverage
ar: تغطية البطارية
fr: Couverture batterie

source: hours
ar: ساعات
fr: heures

# flowValue
source: Flow
ar: التدفق
fr: Débit

# headMetersValue
source: Head
ar: الارتفاع المانومتري
fr: Hauteur manométrique

# pumpPowerLabel
source: Pump power
ar: قوة المضخة
fr: Puissance pompe

# pvPowerLabel
source: PV power
ar: قوة الطاقة الشمسية
fr: Puissance PV

# pumpTypeValue
source: Pump type
ar: نوع المضخة
fr: Type de pompe

source: Request pumping quote
ar: طلب تقدير الضخ
fr: Demander devis pompage

# selectHint
source: Select
ar: اختر
fr: Sélectionnez

source: 🌱 Environmental Impact
ar: 🌱 التأثير البيئي
fr: 🌱 Impact environnemental

# co2Avoided
source: CO₂ avoided: {co2} ton / year
ar: ثاني أكسيد الكربون المتجنب: {co2} طن / سنة
fr: CO₂ évité : {co2} tonne / an

# equivalentTrees
source: Equivalent: {trees} trees / year
ar: المعادل: {trees} شجرة / سنة
fr: Équivalent : {trees} arbres / an

# environmentalEstimationNote
source: These values are estimates based on consumption and sunlight.
ar: هذه القيم تقديرات بناءً على الاستهلاك وأشعة الشمس.
fr: Ces valeurs sont des estimations basées sur la consommation et l'ensoleillement.

# searchCompaniesOrTechnicians
source: Search for companies or technicians
ar: بحث عن شركات أو تقنيين
fr: Rechercher des entreprises ou des techniciens

# searchCompaniesOrTechniciansDescription
source: Find certified professionals near you.
ar: ابحث عن محترفين معتمدين بالقرب منك.
fr: Trouvez des professionnels certifiés près de chez vous.

source: What are you looking for?
ar: ماذا تبحث عنه؟
fr: Que recherchez-vous ?

# searchCertifiedCompanies
source: Search for certified companies
ar: بحث عن شركات معتمدة
fr: Rechercher des entreprises certifiées

# searchCertifiedTechnicians
source: Search for certified technicians
ar: بحث عن تقنيين معتمدين
fr: Rechercher des techniciens certifiés

# companiesSubtitle
source: Partner and certified companies
ar: شركات شريكة ومعتمدة
fr: Entreprises partenaires et certifiées

# techniciansSubtitle
source: Qualified and certified technicians
ar: تقنيين مؤهلين ومعتمدين
fr: Techniciens qualifiés et certifiés

source: Contact
ar: اتصل
fr: Contacter

source: No companies found
ar: لم يتم العثور على شركات
fr: Aucune entreprise trouvée

source: No technicians found
ar: لم يتم العثور على تقنيين
fr: Aucun technicien trouvé

source: Service type
ar: نوع الخدمة
fr: Type de service

source: All
ar: الكل
fr: Tous

source: Speciality
ar: التخصص
fr: Spécialité

source: Patente
ar: الرخصة

source: Address
ar: العنوان
fr: Adresse

source: First name
ar: الاسم
fr: Prénom

source: Last name
ar: اللقب
fr: Nom

source: Company documents
ar: وثائق الشركة
fr: Documents de l'entreprise

source: Certificates
ar: الشهادات
fr: Certificats
