Repository: jawadpython/solarapp1
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# appTitle
source: Tawfir Energy
ar: توفير الطاقة

source: Language
ar: اللغة
fr: Langue

source: French
ar: الفرنسية
fr: Français

source: Arabic
ar: العربية
fr: Arabe

source: English
ar: الإنجليزية
fr: Anglais

source: Profile
ar: الملف الشخصي
fr: Profil

source: Settings
ar: الإعدادات
fr: Paramètres

# slogan
source: Consume smartly, without going broke
ar: استهلك بذكاء، بدون إفلاس
fr: Consommez malin, sans vous ruiner

# requestFreeStudy
source: Request a free study
ar: طلب دراسة مجانية
fr: Demander une étude gratuite

source: Our Services
ar: خدماتنا
fr: Nos Services

# servicesSubtitle
source: Complete solar solutions for sustainable savings.
ar: حلول شمسية شاملة لتوفير مستدام.
fr: Des solutions solaires complètes pour économiser durablement.

# studyQuote
source: Study & Quote Free
ar: دراسة وتقدير مجاني
fr: Étude & Devis Gratuit

# studyQuoteDescription
source: Analysis of your consumption and free estimate of your solar installation.
ar: تحليل استهلاكك وتقدير مجاني لتركيبك الشمسي.
fr: Analyse de votre consommation et estimation gratuite de votre installation solaire.

source: Installation
ar: التركيب

# installationDescription
source: Professional installation compliant with standards for individuals and businesses.
ar: تركيب احترافي متوافق مع المعايير للأفراد والشركات.
fr: Installation professionnelle conforme aux normes pour particuliers et entreprises.

source: Solar Calculator
ar: حاسبة الطاقة الشمسية
fr: Calculateur Solaire

# solarCalculatorDescription
source: Estimate your installation and savings in a few clicks.
ar: قدّر تركيبك ومدخراتك ببضع نقرات.
fr: Estimez votre installation et vos économies en quelques clics.

source: Maintenance & Repair
ar: الصيانة والإصلاح
fr: maintenance & Réparation

# maintenanceRepairDescription
source: Maintenance, diagnosis and repair of your existing solar systems.
ar: صيانة وتشخيص وإصلاح أنظمتك الشمسية الموجودة.
fr: Entretien, diagnostic et réparation de vos systèmes solaires existants.

source: Certified Technicians
ar: فنيون معتمدون
fr: Techniciens Certifiés

# certifiedTechniciansDescription
source: Intervention by qualified and certified technicians throughout Morocco.
ar: تدخل من قبل فنيين مؤهلين ومعتمدين في جميع أنحاء المغرب.
fr: Intervention par des techniciens qualifiés et certifiés partout au Maroc.

# proSpaceInfo
source: Pro Space: Reserved for partner companies and technicians
ar: المساحة المهنية: مخصصة للشركات والفنيين الشركاء
fr: Espace Pro: Réservé aux entreprises et techniciens partenaires

source: Home
ar: الرئيسية
fr: Accueil

source: Pro Space
ar: المساحة المهنية
fr: Espace Pro

source: Chat
ar: الدردشة

source: Shop
ar: المتجر
fr: Boutique

# chatComingSoon
source: Chat will be available soon
ar: الدردشة ستكون متاحة قريباً
fr: Chat sera bientôt disponible

# shopComingSoon
source: Shop will be available soon
ar: المتجر سيفتح قريباً
fr: Boutique ouvrira bientôt

source: Login
ar: تسجيل الدخول
fr: Connexion

# connectToAccount
source: Connect to your account
ar: تسجيل الدخول إلى حسابك
fr: Connectez-vous à votre compte

# email
source: Email address
ar: البريد الإلكتروني
fr: Adresse e-mail

source: Password
ar: كلمة المرور
fr: Mot de passe

source: Forgot password?
ar: نسيت كلمة المرور؟
fr: Mot de passe oublié ?

# noAccount
source: Don't have an account yet?
ar: ليس لديك حساب بعد؟
fr: Pas encore de compte ?

source: Create account
ar: إنشاء حساب
fr: Créer un compte

source: Register
ar: التسجيل
fr: S'inscrire

# registerTitle
source: Create Account
ar: إنشاء حساب
fr: Créer un compte

# joinToday
source: Join Tawfir Energy today
ar: انضم إلى طوفير للطاقة اليوم
fr: Rejoignez Tawfir Energy aujourd'hui

source: Full Name
ar: الاسم الكامل
fr: Nom complet

# enterFullName
source: Enter your full name
ar: أدخل اسمك الكامل
fr: Entrez votre nom complet

# enterEmail
source: Enter your email
ar: أدخل بريدك الإلكتروني
fr: Entrez votre adresse e-mail

# enterPassword
source: Enter your password
ar: أدخل كلمة المرور
fr: Entrez votre mot de passe

source: Confirm Password
ar: تأكيد كلمة المرور
fr: Confirmer le mot de passe

# enterConfirmPassword
source: Confirm your password
ar: أكد كلمة المرور
fr: Confirmez votre mot de passe

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟
fr: Vous avez déjà un compte ?

# otherSettingsComing
source: Other settings coming soon...
ar: إعدادات أخرى قادمة...
fr: Autres paramètres à venir...

source: Become Partner
ar: كن شريكاً
fr: Devenir Partenaire

source: Company
ar: شركة
fr: Entreprise

# partnerDescription
source: For certified solar energy companies
ar: للشركات المعتمدة في الطاقة الشمسية
fr: Pour les entreprises certifiées en énergie solaire

source: Become Technician
ar: كن فنيًا
fr: Devenir Technicien

# technicianDescription
source: For certified technicians in maintenance and installation
ar: للفنيين المعتمدين في الصيانة والتركيب
fr: Pour les techniciens certifiés en maintenance et installation

source: Start
ar: ابدأ
fr: Commencer

# billAmount
source: Bill Amount (DH)
ar: مبلغ الفاتورة (درهم)
fr: Montant de la facture (DH)

# monthlyBillAmount
source: Monthly bill amount (DH) *
ar: مبلغ الفاتورة الشهرية (درهم) *
fr: Montant facture mensuelle (DH) *

# enterBillAmount
source: Enter your bill amount
ar: أدخل مبلغ فاتورتك
fr: Entrez le montant de votre facture

source: System Type
ar: نوع النظام
fr: Type de système

source: Select system type
ar: اختر نوع النظام
fr: Sélectionnez le type de système

# selectType
source: Select a type
ar: اختر نوعاً
fr: Sélectionnez un type

source: Region
ar: المنطقة
fr: Région

# selectRegion
source: Select your region
ar: اختر منطقتك
fr: Sélectionnez votre région

# selectRegionHint
source: Select a region
ar: اختر منطقة
fr: Sélectionnez une région

source: Usage Type
ar: نوع الاستخدام
fr: Type d'utilisation

source: Select usage type
ar: اختر نوع الاستخدام
fr: Sélectionnez le type d'utilisation

source: Panel Power
ar: قوة اللوحة
fr: Puissance du panneau

source: Panel Power (W)
ar: قوة اللوحة (واط)
fr: Puissance du panneau (W)

source: Select panel power
ar: اختر قوة اللوحة
fr: Sélectionnez la puissance du panneau

source: Calculate
ar: احسب
fr: Calculer

source: Calculating...
ar: جاري الحساب...
fr: Calcul en cours...

# fillAllFields
source: Please fill all required fields
ar: يرجى ملء جميع الحقول الإلزامية
fr: Veuillez remplir tous les champs obligatoires

# fillThisField
source: Please fill this field
ar: يرجى ملء هذا الحقل
fr: Veuillez remplir ce champ

source: Invalid bill amount
ar: مبلغ الفاتورة غير صالح
fr: Montant de facture invalide

source: Error loading regions
ar: خطأ في تحميل المناطق
fr: Erreur lors du chargement des régions

source: Error calculating
ar: خطأ في الحساب
fr: Erreur lors du calcul

source: House
ar: منزل
fr: Maison

source: Commerce
ar: تجاري

source: Industry
ar: صناعي
fr: Industrie

source: Submit
ar: إرسال
fr: Soumettre

source: Cancel
ar: إلغاء
fr: Annuler

source: Save
ar: حفظ
fr: Enregistrer

source: Edit
ar: تعديل
fr: Modifier

source: Delete
ar: حذف
fr: Supprimer

source: Back
ar: رجوع
fr: Retour

source: Next
ar: التالي
fr: Suivant

source: Previous
ar: السابق
fr: Précédent

source: Done
ar: تم
fr: Terminé

source: Loading...
ar: جاري التحميل...
fr: Chargement...

source: Error
ar: خطأ
fr: Erreur

source: Success
ar: نجح
fr: Succès

source: Required
ar: مطلوب
fr: Requis

source: Optional
ar: اختياري
fr: Optionnel

source: OK
ar: موافق

source: Close
ar: إغلاق
fr: Fermer

# firebaseNotInitialized
source: Error: Firebase is not initialized. Please configure Firebase.
ar: خطأ: Firebase غير مهيأ. يرجى تكوين Firebase.
fr: Erreur: Firebase n'est pas initialisé. Veuillez configurer Firebase.

source: Error sending
ar: خطأ في الإرسال
fr: Erreur lors de l'envoi

source: Error details
ar: تفاصيل الخطأ
fr: Détails de l'erreur

source: New quote request
ar: طلب دراسة وتقدير جديد
fr: Nouvelle demande d'étude de devis

source: Quote Request
ar: طلب تقدير
fr: Demande de devis

source: Consumption
ar: الاستهلاك
fr: Consommation

source: Details
ar: التفاصيل
fr: Détails

source: Use my location
ar: استخدام موقعي
fr: Utiliser ma position

source: GPS Location
ar: موقع GPS
fr: Localisation GPS

# clickUseLocation
source: Click on "Use my location"
ar: انقر على "استخدام موقعي"
fr: Cliquez sur "Utiliser ma position"

# gpsCaptured
source: GPS location captured
ar: تم التقاط موقع GPS
fr: Position GPS capturée

# gpsDetectedSuccess
source: GPS location detected successfully
ar: تم اكتشاف موقع GPS بنجاح
fr: Position GPS détectée avec succès

# gpsDetectionFailed
source: Unable to detect your location. Please verify that location services are enabled and you have granted the necessary permissions.
ar: تعذر اكتشاف موقعك. يرجى التحقق من أن خدمات الموقع مفعلة وأنك منحت الأذونات اللازمة.
fr: Impossible de détecter votre position. Veuillez vérifier que les services de localisation sont activés et que vous avez accordé les permissions nécessaires.

# gpsError
source: Error detecting location
ar: خطأ في اكتشاف الموقع
fr: Erreur lors de la détection de la position

# uploadDisabled
source: Upload temporarily disabled. Feature will be activated soon 👍
ar: الرفع معطل مؤقتاً. ستتم تفعيل الميزة قريباً 👍

# chooseBill
source: Choose a bill
ar: اختر فاتورة
fr: Choisir une facture

source: Financing Option
ar: خيار التمويل
fr: Option Financement

source: Access financing form
ar: الوصول إلى نموذج التمويل
fr: Accéder au formulaire de financement

source: Maintenance Request
ar: طلب صيانة
fr: Demande de maintenance

# personalInfo
source: Personal Information
ar: المعلومات الشخصية
fr: Informations personnelles

source: Name
ar: الاسم
fr: Nom

# nameHint
source: Ex: Ahmed Benali
ar: مثال: أحمد بن علي

source: Phone
ar: الهاتف
fr: Téléphone

# phoneHint
source: Ex: +212 612 345 678
ar: مثال: +212 612 345 678

source: City
ar: المدينة
fr: Ville

# cityHint
source: Ex: Casablanca
ar: مثال: الدار البيضاء

# describeProblem
source: Describe the problem
ar: وصف المشكلة
fr: Décrivez le problème

# describeProblemHint
source: Describe the problem you are experiencing...
ar: صف المشكلة التي تواجهها...
fr: Décrivez le problème que vous rencontrez...

source: Urgency
ar: الأولوية
fr: Urgence

# selectUrgency
source: Select urgency level
ar: اختر مستوى الأولوية
fr: Sélectionnez le niveau d'urgence

# urgencyLow
source: Low
ar: منخفضة
fr: Faible

# urgencyNormal
source: Normal
ar: عادية
fr: Normale

# urgencyHigh
source: High
ar: عالية
fr: Élevée

# urgencyUrgent
source: Urgent
ar: عاجلة
fr: Urgente

source: Add photo/video
ar: إضافة صورة/فيديو
fr: Ajouter photo/vidéo

source: Photo
ar: صورة

source: Video
ar: فيديو
fr: Vidéo

# mediaAdded
source: Media added (feature coming soon)
ar: تمت إضافة الوسائط (ميزة قادمة)
fr: Média ajouté (fonctionnalité à venir)

# callFeatureComing
source: Call feature coming soon
ar: ميزة الاتصال قادمة
fr: Fonctionnalité d'appel à venir

source: Company Name
ar: اسم الشركة
fr: Nom de l'entreprise

# companyNameHint
source: Ex: Solar Energy Maroc
ar: مثال: الطاقة الشمسية المغرب

# cityHintPartner
source: Ex: Casablanca
ar: مثال: الدار البيضاء

# phoneHintPartner
source: Ex: +212 612 345 678
ar: مثال: +212 612 345 678

# emailHint
source: Ex: contact@entreprise.com
ar: مثال: contact@entreprise.com

source: Specialty
ar: التخصص
fr: Spécialité

# specialtyHint
source: Ex: Solar installation, Maintenance...
ar: مثال: تركيب الطاقة الشمسية، الصيانة...
fr: Ex: Installation solaire, Maintenance...

# enterValidNumber
source: Please enter a valid number
ar: يرجى إدخال رقم صالح
fr: Veuillez entrer un nombre valide

# amountMustBeGreater
source: Amount must be greater than 50 DH
ar: يجب أن يكون المبلغ أكبر من 50 درهم
fr: Le montant doit être supérieur à 50 DH

source: Request Sent
ar: تم إرسال الطلب
fr: Demande envoyée

# requestSentSuccess
source: Your intervention request has been sent successfully.
ar: تم إرسال طلب التدخل بنجاح.
fr: Votre demande d'intervention a été envoyée avec succès.

source: Detect my position
ar: اكتشف موقعي
fr: Détecter ma position

# addressGps
source: Address / GPS Coordinates *
ar: العنوان / إحداثيات GPS *
fr: Adresse / Coordonnées GPS *

# captureGpsPosition
source: Please capture your GPS position
ar: يرجى التقاط موقع GPS الخاص بك
fr: Veuillez capturer votre position GPS

source: Call technician
ar: اتصل بالفني
fr: Appeler technicien

source: Intervention Request
ar: طلب تدخل
fr: Demande intervention

# systemTypeLabel
source: System Type
ar: نوع النظام
fr: Type de système

source: Location Type
ar: نوع الموقع
fr: Type d'emplacement

# describeBriefly
source: Briefly describe your request...
ar: صف طلبك باختصار...
fr: Décrivez brièvement votre demande...

# photosOptional
source: Photos (optional, max 3)
ar: الصور (اختياري، حد أقصى 3)
fr: Photos (optionnel, max 3)

# addPhoto
source: Add a photo
ar: إضافة صورة
fr: Ajouter une photo

# maxPhotosAllowed
source: Maximum 3 photos allowed
ar: الحد الأقصى 3 صور مسموح بها
fr: Maximum 3 photos autorisées

# photoAdded
source: Photo added (feature coming soon)
ar: تمت إضافة الصورة (ميزة قادمة)
fr: Photo ajoutée (fonctionnalité à venir)

source: Upload documents
ar: رفع المستندات
fr: Téléverser des documents

# documents
source: Documents (certificates, licenses)
ar: المستندات (الشهادات، التراخيص)
fr: Documents (certificats, licences)

# certificatesDocuments
source: Certificates and documents
ar: الشهادات والمستندات
fr: Certificats et documents

source: Note
ar: ملاحظة

# addAdditionalInfo
source: Add additional information...
ar: أضف معلومات إضافية...
fr: Ajoutez des informations supplémentaires...

# gpsCoordinates
source: Ex: 33.5731, -7.5898
ar: مثال: 33.5731, -7.5898

# emailExample
source: Ex: ahmed@example.com
ar: مثال: ahmed@example.com

# fullNameLabel
source: Full Name *
ar: الاسم الكامل *
fr: Nom complet *

# phoneLabel
source: Phone *
ar: الهاتف *
fr: Téléphone *

# cityLabel
source: City *
ar: المدينة *
fr: Ville *

# enterYourName
source: Please enter your name
ar: يرجى إدخال اسمك
fr: Veuillez entrer votre nom

# enterYourPhone
source: Please enter your phone number
ar: يرجى إدخال رقم هاتفك
fr: Veuillez entrer votre numéro de téléphone

# enterYourCity
source: Please enter your city
ar: يرجى إدخال مدينتك
fr: Veuillez entrer votre ville

# enterCompanyName
source: Please enter company name
ar: يرجى إدخال اسم الشركة
fr: Veuillez entrer le nom de l'entreprise

source: Send Request
ar: إرسال الطلب
fr: Envoyer demande

source: Create Request
ar: إنشاء طلب
fr: Créer demande

source: Request Quote
ar: طلب تقدير
fr: Demander un devis

# descriptionShort
source: Short Description
ar: وصف قصير
fr: Description courte

source: GPS (optional)
ar: GPS (اختياري)
fr: GPS (optionnel)

source: Note (optional)
ar: ملاحظة (اختياري)
fr: Note (optionnel)

source: Calculation Result
ar: نتيجة الحساب
fr: Résultat du Calcul

source: Calculation Results
ar: نتائج الحساب
fr: Résultats du Calcul

source: Estimated consumption
ar: الاستهلاك المقدر
fr: Consommation estimée

source: Recommended system power
ar: قوة النظام الموصى بها
fr: Puissance système recommandée

source: Number of panels
ar: عدد الألواح
fr: Nombre de panneaux

source: Saving rate
ar: معدل التوفير
fr: Taux d'économie

source: Savings
ar: التوفير
fr: Économie

source: Monthly
ar: شهري
fr: Mensuelle

source: Yearly
ar: سنوي
fr: Annuelle

# tenYears
source: 10 years
ar: 10 سنوات
fr: 10 ans

# twentyYears
source: 20 years
ar: 20 سنة
fr: 20 ans

# basedOnSunHours
source: Based on sun hours of {month} – {region}
ar: بناءً على ساعات الشمس في {month} – {region}
fr: Basé sur les heures solaires de {month} – {region}

# estimatedResults
source: Estimated results — final quote after technical study
ar: نتائج تقديرية — التقدير النهائي بعد الدراسة التقنية
fr: Résultats estimatifs — devis final après étude technique

# requestDevis
source: Request a Quote
ar: طلب تقدير
fr: Demander un Devis

# requestPumpingDevis
source: Request Pumping Quote
ar: طلب تقدير الضخ
fr: Demander un Devis Pompage

# height
source: Height (H)
ar: الارتفاع (H)
fr: Hauteur (H)

source: Pump power
ar: قوة المضخة
fr: Puissance pompe

source: PV power
ar: قوة الطاقة الشمسية
fr: Puissance PV

source: No media selected
ar: لم يتم اختيار وسائط
fr: Aucun média sélectionné

source: No document selected
ar: لم يتم اختيار مستند
fr: Aucun document sélectionné

source: No photo selected
ar: لم يتم اختيار صورة
fr: Aucune photo sélectionnée

source: Request created
ar: تم إنشاء الطلب
fr: Demande créée

# demandSent
source: Request sent
ar: تم إرسال الطلب
fr: Demande envoyée

# devisRequestSentSuccess
source: Your quote request has been sent successfully.
ar: تم إرسال طلب التقدير بنجاح.
fr: Votre demande de devis a été envoyée avec succès.

# pumpingDevisSentSuccess
source: Pumping quote request sent successfully
ar: تم إرسال طلب تقدير الضخ بنجاح
fr: Demande de devis envoyée avec succès

# registrationSentSuccess
source: Your registration request has been sent successfully. We will contact you soon.
ar: تم إرسال طلب التسجيل بنجاح. سنتواصل معك قريباً.
fr: Votre demande d'inscription a été envoyée avec succès. Nous vous contacterons bientôt.

# partnershipSentSuccess
source: Your partnership request has been sent successfully. We will contact you soon.
ar: تم إرسال طلب الشراكة بنجاح. سنتواصل معك قريباً.
fr: Votre demande de partenariat a été envoyée avec succès. Nous vous contacterons bientôt.

# whatsAppFeatureComing
source: WhatsApp feature coming soon
ar: ميزة واتساب قادمة
fr: Fonction WhatsApp à venir

source: WhatsApp Contact
ar: اتصال واتساب

source: Back to Home
ar: العودة إلى الرئيسية
fr: Retour à l'accueil

# technicalData
source: Technical data (read-only)
ar: البيانات التقنية (للقراءة فقط)
fr: Données techniques (lecture seule)

source: Region code
ar: رمز المنطقة
fr: Code région

source: Consumption (kWh/month)
ar: الاستهلاك (كيلوواط ساعة/شهر)
fr: Consommation (kWh/mois)

source: Recommended power
ar: القوة الموصى بها
fr: Puissance recommandée

# contactInfo
source: Contact information
ar: معلومات الاتصال
fr: Informations de contact

# enterConsumption
source: Please enter consumption
ar: يرجى إدخال الاستهلاك
fr: Veuillez entrer la consommation

# describeProblemRequired
source: Please describe the problem
ar: يرجى وصف المشكلة
fr: Veuillez décrire le problème

# enterCityOrAddress
source: Please enter your city or address
ar: يرجى إدخال مدينتك أو عنوانك
fr: Veuillez saisir votre ville ou adresse

# addPhotoCount
source: Add photo ({count}/3)
ar: إضافة صورة ({count}/3)
fr: Ajouter une photo ({count}/3)

# enterSpecialty
source: Please enter your specialty
ar: يرجى إدخال تخصصك
fr: Veuillez entrer votre spécialité

# enterValidEmail
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صالح
fr: Veuillez entrer un email valide

source: Email (optional)
ar: البريد الإلكتروني (اختياري)
fr: Email (optionnel)

source: Enter kWh
ar: إدخال كيلوواط ساعة
fr: Entrer kWh

source: Upload bill
ar: رفع الفاتورة
fr: Télécharger facture

source: Consumption (kWh)
ar: الاستهلاك (كيلوواط ساعة)
fr: Consommation (kWh)

source: No file selected
ar: لم يتم اختيار ملف
fr: Aucun fichier sélectionné

source: GPS position captured
ar: تم التقاط موقع GPS
fr: Position GPS capturée

# hybridSystem
source: Hybrid
ar: هجين
fr: Hybride

# pumpSystem
source: Pump
ar: مضخة
fr: Pompe

# homeLocation
source: Home
ar: منزل
fr: Maison

# businessLocation
source: Business
ar: شركة
fr: Entreprise

# farmLocation
source: Farm
ar: مزرعة
fr: Ferme

# otherLocation
source: Other
ar: أخرى
fr: Autre

source: Welcome back!
ar: مرحباً بعودتك!

source: Enter your email
ar: أدخل بريدك الإلكتروني

source: Enter your password
ar: أدخل كلمة المرور

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

# registerButton
source: Register
ar: التسجيل

# pumpingSolar
source: Solar Pumping
ar: الضخ الشمسي
fr: Pompage Solaire

# pumpingSolarDescription
source: Calculate your solar pumping system with precision.
ar: احسب نظام الضخ الشمسي الخاص بك بدقة.
fr: Calculez votre système de pompage solaire avec précision.

# pumpingSolarSubtitle
source: Estimated results based on your region and actual needs.
ar: نتائج تقديرية بناءً على منطقتك واحتياجاتك الفعلية.
fr: Résultats estimatifs basés sur votre région et vos besoins réels.

# step1ChooseMethod
source: Step 1 — Choose calculation method
ar: الخطوة 1 — اختر طريقة الحساب
fr: Étape 1 — Choisir la méthode de calcul

# step2EnterInfo
source: Step 2 — Enter information
ar: الخطوة 2 — أدخل المعلومات
fr: Étape 2 — Renseigner les informations

# step3Calculate
source: Step 3 — Calculate results
ar: الخطوة 3 — حساب النتائج
fr: Étape 3 — Calcul des résultats

# modeFlowTitle
source: I already have the flow (Q)
ar: لدي التدفق بالفعل (Q)
fr: J'ai déjà le débit (Q)

# modeFlowDescription
source: Use this mode if you already know your pump's flow rate.
ar: استخدم هذا الوضع إذا كنت تعرف بالفعل تدفق المضخة الخاصة بك.
fr: Utilisez ce mode si vous connaissez déjà le débit de votre pompe.

# modeAreaTitle
source: I don't know the flow (agricultural area)
ar: لا أعرف التدفق (مساحة زراعية)
fr: Je ne connais pas le débit (superficie agricole)

# modeAreaDescription
source: Ideal for farmers who know the area and crop type.
ar: مثالي للمزارعين الذين يعرفون المساحة ونوع المحصول.
fr: Idéal pour les agriculteurs qui connaissent la surface et le type de culture.

# modeTankTitle
source: I have a tank
ar: لدي خزان
fr: J'ai un réservoir

# modeTankDescription
source: Use this mode if you fill a water tower or cistern.
ar: استخدم هذا الوضع إذا كنت تملأ برج مياه أو خزان.
fr: Utilisez ce mode si vous remplissez un château d'eau ou une citerne.

source: Current energy source
ar: مصدر الطاقة الحالي
fr: Source d'énergie actuelle

# selectCurrentEnergySource
source: Please select your current energy source
ar: يرجى اختيار مصدر الطاقة الحالي
fr: Sélectionnez votre source d'énergie actuelle

# selectSource
source: Select a source
ar: اختر مصدراً
fr: Sélectionnez une source

source: Electricity
ar: الكهرباء
fr: Électricité

source: Diesel
ar: الديزل

# unknown
source: I don't know
ar: لا أعرف
fr: Je ne sais pas

# selectCalculationMethod
source: Please select a calculation method
ar: يرجى اختيار طريقة الحساب
fr: Veuillez sélectionner une méthode de calcul

# selectYourRegion
source: Please select your region
ar: يرجى اختيار منطقتك
fr: Veuillez sélectionner votre région

# selectYourEnergySource
source: Please select your current energy source
ar: يرجى اختيار مصدر الطاقة الحالي
fr: Veuillez sélectionner votre source d'énergie actuelle

# calculationError
source: An error occurred during calculation. Please check your data and try again.
ar: حدث خطأ أثناء الحساب. يرجى التحقق من بياناتك والمحاولة مرة أخرى.
fr: Une erreur s'est produite lors du calcul. Veuillez vérifier vos données et réessayer.

source: Flow
ar: التدفق
fr: Débit

# enterFlow
source: Please enter the flow
ar: يرجى إدخال التدفق
fr: Veuillez saisir le débit

# flowMustBeGreater
source: Flow must be greater than 0
ar: يجب أن يكون التدفق أكبر من 0
fr: Le débit doit être supérieur à 0

source: Unit
ar: الوحدة
fr: Unité

# flowUnitM3h
source: m³/h
ar: م³/ساعة

# flowUnitLmin
source: L/min
ar: لتر/دقيقة

# headMeters
source: Head (m)
ar: الارتفاع المانومتري (م)
fr: Hauteur manométrique (m)

source: Operating hours per day
ar: ساعات التشغيل في اليوم
fr: Heures de fonctionnement par jour

source: Surface
ar: المساحة

# enterSurface
source: Please enter the surface
ar: يرجى إدخال المساحة
fr: Veuillez saisir la surface

# surfaceMustBeGreater
source: Surface must be greater than 0
ar: يجب أن تكون المساحة أكبر من 0
fr: La surface doit être supérieure à 0

# areaUnitM2
source: m²
ar: م²

# areaUnitHa
source: ha
ar: هكتار

source: Crop type
ar: نوع المحصول
fr: Type de culture

# selectCropType
source: Select a crop
ar: اختر محصولاً
fr: Sélectionnez une culture

source: Irrigation type
ar: نوع الري
fr: Type d'irrigation

# selectIrrigationType
source: Select a type
ar: اختر نوعاً
fr: Sélectionnez un type

# tankVolume
source: Tank volume (m³)
ar: حجم الخزان (م³)
fr: Volume du réservoir (m³)
